Model: "cnn_topomap_classification_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 16)      1216      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 16)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 32)      12832     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 32)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 64)        51264     
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 64)        0         
_________________________________________________________________
dropout (Dropout)            (None, 28, 28, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 50176)             0         
_________________________________________________________________
dense (Dense)                (None, 128)               6422656   
_________________________________________________________________
dropout_1 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 387       
=================================================================
Total params: 6,488,355
Trainable params: 6,488,355
Non-trainable params: 0
_________________________________________________________________
loss:0.2336352801322937
accuracy:0.9125396609306335
using 80 epochs


              precision    recall  f1-score     support
0              0.907122  0.897619  0.902346  2100.00000
1              0.928991  0.903333  0.915983  2100.00000
2              0.902294  0.936667  0.919159  2100.00000
accuracy       0.912540  0.912540  0.912540     0.91254
macro avg      0.912802  0.912540  0.912496  6300.00000
weighted avg   0.912802  0.912540  0.912496  6300.00000
