Model: "cnn_topomap_classification_model_150_2by2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_9 (Conv2D)            (None, 224, 224, 16)      1216      
_________________________________________________________________
max_pooling2d_9 (MaxPooling2 (None, 112, 112, 16)      0         
_________________________________________________________________
conv2d_10 (Conv2D)           (None, 112, 112, 32)      12832     
_________________________________________________________________
max_pooling2d_10 (MaxPooling (None, 56, 56, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 56, 56, 64)        51264     
_________________________________________________________________
max_pooling2d_11 (MaxPooling (None, 28, 28, 64)        0         
_________________________________________________________________
dropout_6 (Dropout)          (None, 28, 28, 64)        0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 50176)             0         
_________________________________________________________________
dense_6 (Dense)              (None, 128)               6422656   
_________________________________________________________________
dropout_7 (Dropout)          (None, 128)               0         
_________________________________________________________________
dense_7 (Dense)              (None, 3)                 387       
=================================================================
Total params: 6,488,355
Trainable params: 6,488,355
Non-trainable params: 0
_________________________________________________________________
loss:0.2357442341418937
accuracy:0.9223809242248535
trained using 150 epochs
              precision    recall  f1-score      support
0              0.917024  0.915714  0.916369  2100.000000
1              0.929859  0.909048  0.919335  2100.000000
2              0.920465  0.942381  0.931294  2100.000000
accuracy       0.922381  0.922381  0.922381     0.922381
macro avg      0.922449  0.922381  0.922333  6300.000000
weighted avg   0.922449  0.922381  0.922333  6300.000000