Model: "cnn_topomap_classification_model_2"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 32)      2432      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 64)      51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       204928    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
dropout (Dropout)            (None, 28, 28, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 100352)            0         
_________________________________________________________________
dense (Dense)                (None, 256)               25690368  
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 771       
=================================================================
Total params: 25,949,763
Trainable params: 25,949,763
Non-trainable params: 0
_________________________________________________________________
loss:0.23989453354850412
accuracy:0.9130159020423889
trained using 40 epochs
              precision    recall  f1-score      support
0              0.906101  0.905238  0.905669  2100.000000
1              0.918230  0.909048  0.913616  2100.000000
2              0.914743  0.924762  0.919725  2100.000000
accuracy       0.913016  0.913016  0.913016     0.913016
macro avg      0.913025  0.913016  0.913003  6300.000000
weighted avg   0.913025  0.913016  0.913003  6300.000000