Model: "cnn_topomap_classification_model_2_w_100"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 32)      2432      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 64)      51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       204928    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
dropout (Dropout)            (None, 28, 28, 128)       0         
_________________________________________________________________
flatten (Flatten)            (None, 100352)            0         
_________________________________________________________________
dense (Dense)                (None, 256)               25690368  
_________________________________________________________________
dropout_1 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 771       
=================================================================
Total params: 25,949,763
Trainable params: 25,949,763
Non-trainable params: 0
_________________________________________________________________
loss:0.25725082247398656
accuracy:0.93365079164505
trained using 100 epochs
              precision    recall  f1-score      support
0              0.908345  0.948571  0.928022  2100.000000
1              0.941518  0.927619  0.934517  2100.000000
2              0.952895  0.924762  0.938618  2100.000000
accuracy       0.933651  0.933651  0.933651     0.933651
macro avg      0.934252  0.933651  0.933719  6300.000000
weighted avg   0.934252  0.933651  0.933719  6300.000000