Model: "cnn_topomap_classification_model_vgg"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 220, 220, 32)      2432      
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 216, 216, 32)      25632     
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 108, 108, 32)      0         
_________________________________________________________________
dropout (Dropout)            (None, 108, 108, 32)      0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 104, 104, 64)      51264     
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 100, 100, 64)      102464    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 50, 50, 64)        0         
_________________________________________________________________
dropout_1 (Dropout)          (None, 50, 50, 64)        0         
_________________________________________________________________
flatten (Flatten)            (None, 160000)            0         
_________________________________________________________________
dense (Dense)                (None, 256)               40960256  
_________________________________________________________________
dropout_2 (Dropout)          (None, 256)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 771       
=================================================================
Total params: 41,142,819
Trainable params: 41,142,819
Non-trainable params: 0
_________________________________________________________________
loss:0.29635299496352674
accuracy:0.8871428370475769
trained using 40 epochs
              precision    recall  f1-score      support
0              0.869545  0.901429  0.885200  2100.000000
1              0.901029  0.875714  0.888191  2100.000000
2              0.891931  0.884286  0.888092  2100.000000
accuracy       0.887143  0.887143  0.887143     0.887143
macro avg      0.887502  0.887143  0.887161  6300.000000
weighted avg   0.887502  0.887143  0.887161  6300.000000