Model: "cnn_topomap_classification_model_10"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 80)      6080      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 80)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 120)     240120    
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 120)       0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 160)       480160    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 160)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 200)       800200    
_________________________________________________________________
flatten (Flatten)            (None, 156800)            0         
_________________________________________________________________
dense (Dense)                (None, 120)               18816120  
_________________________________________________________________
dropout (Dropout)            (None, 120)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 60)                7260      
_________________________________________________________________
dropout_1 (Dropout)          (None, 60)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 3)                 183       
=================================================================
Total params: 20,350,123
Trainable params: 20,350,123
Non-trainable params: 0
_________________________________________________________________
loss:0.37367149820995854
accuracy:0.9268254041671753
trained using 60 epochs
              precision    recall  f1-score      support
0              0.918522  0.923333  0.920921  2100.000000
1              0.922532  0.930000  0.926251  2100.000000
2              0.939672  0.927143  0.933365  2100.000000
accuracy       0.926825  0.926825  0.926825     0.926825
macro avg      0.926909  0.926825  0.926846  6300.000000
weighted avg   0.926909  0.926825  0.926846  6300.000000