Model: "cnn_topomap_classification_model_6_w_40"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 32)      2432      
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 112, 112, 64)      51264     
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 56, 56, 128)       204928    
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 28, 28, 256)       819456    
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, 14, 14, 256)       0         
_________________________________________________________________
dropout (Dropout)            (None, 14, 14, 256)       0         
_________________________________________________________________
flatten (Flatten)            (None, 50176)             0         
_________________________________________________________________
dense (Dense)                (None, 512)               25690624  
_________________________________________________________________
dropout_1 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_1 (Dense)              (None, 3)                 1539      
=================================================================
Total params: 26,770,243
Trainable params: 26,770,243
Non-trainable params: 0
_________________________________________________________________
loss:0.29807116361558966
accuracy:0.9334920644760132
trained using 100 epochs
              precision    recall  f1-score      support
0              0.922680  0.937619  0.930090  2100.000000
1              0.931461  0.931905  0.931683  2100.000000
2              0.946731  0.930952  0.938776  2100.000000
accuracy       0.933492  0.933492  0.933492     0.933492
macro avg      0.933624  0.933492  0.933516  6300.000000
weighted avg   0.933624  0.933492  0.933516  6300.000000